# GetCouplerId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetCouplerId Method
Rebar Class See Also
---
Get the id of the Rebar Coupler that is applied to the rebar at the specified end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public ElementId GetCouplerId(
	int end
)
```

Visual Basic
---
```text
Public Function GetCouplerId ( _
	end As Integer _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetCouplerId(
	int end
)
```

# ### Parameters
end
    Type: System..::..Int32 0 for the start Rebar Coupler, 1 for the end Rebar Coupler.
# ### Return Value
The id of a Rebar Coupler, or invalidElementId if the rebar has no Rebar Coupler at the specified end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | end must be 0 or 1. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace